Project/Toir/src/DataProcessors/ОблачныйАрхив/ОблачныйАрхив.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ОблачныйАрхив</name>
</mdclass:DataProcessor>

Project/Toir/src/InformationRegisters/СвойстваХранилищаОблачногоАрхива/СвойстваХранилищаОблачногоАрхива.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвойстваХранилищаОблачногоАрхива</name>
  <attributes>
    <name>ДатаПроверки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Значение</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Свойство</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/РезервныеКопииОблачногоАрхива/РезервныеКопииОблачногоАрхива.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РезервныеКопииОблачногоАрхива</name>
  <attributes>
    <name>РазмерФайла</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяИБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ИдентификаторИБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/DataProcessors/ОблачныйАрхив/Forms/МастерСозданияРезервнойКопии/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если НЕ ОблачныйАрхивПовтИсп.РазрешенаРаботаСОблачнымАрхивом() Тогда
		Отказ = Истина;
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;

	Если ОбщегоНазначения.ЭтоВебКлиент() Тогда
		Отказ = Истина;
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;

	ЕстьОшибки = Ложь;
	ВремяНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
	КонтекстВыполнения = ИнтернетПоддержкаПользователейКлиентСервер.НоваяЗаписьРезультатовВыполненияОпераций();
	ИдентификаторИБ = "";
	ИдентификаторИБ_Полный = "";

	// 1. Собрать данные о клиентском компьютере.
#Область СборДанных

	ИнтернетПоддержкаПользователейКлиентСервер.НачатьРегистрациюРезультатаВыполненияОперации(
		КонтекстВыполнения,
		"ОблачныйАрхив.СозданиеФайлаРезервнойКопии.Инициализация.СборДанных",
		НСтр("es='La recogida de los datos sobre los ajustes';ru='Сбор данных о настройках';en='Settings data collection'"));
	КодРезультата = 0;
	ОписаниеРезультата = "";

		// Сбор информации запускается сразу, а не фоновым заданием.
		ЗагрузитьСтатистику(300);

	ИнтернетПоддержкаПользователейКлиентСервер.ЗавершитьРегистрациюРезультатаВыполненияОперации(
		КонтекстВыполнения,
		КодРезультата,
		ОписаниеРезультата,
		Неопределено);
#КонецОбласти

	// 2. Анализ возможности запуска.
#Область ПроверкаВозможностиСозданияРезервнойКопии

	// 2.1. Проанализировать данные клиентского компьютера.
#Область ПроверкаВозможностиСозданияРезервнойКопии_НастройкиКлиентскогоКомпьютера
	// Получить настройки клиента (путь расположения файлов настроек).
	// Для файл-серверного режима клиент и сервер выполняются на одном компьютере.

	ИнтернетПоддержкаПользователейКлиентСервер.НачатьРегистрациюРезультатаВыполненияОперации(
		КонтекстВыполнения,
		"ОблачныйАрхив.СозданиеФайлаРезервнойКопии.Инициализация.АнализДанных.ИнформацияОКомпьютере",
		НСтр("es='La información sobre el ordenador de clientes';ru='Информация о клиентском компьютере';en='Client computer information'"));
	КодРезультата = 0;
	ОписаниеРезультата = "";

		ИнформацияОКлиенте = ОблачныйАрхив.ПолучитьНастройкиОблачногоАрхива("ИнформацияОКлиенте", ИмяКомпьютера());
		АктивацииАгентовКопирования = ОблачныйАрхив.ПолучитьНастройкиОблачногоАрхива("АктивацииАгентовКопирования", ИмяКомпьютера());
		Если (ИнформацияОКлиенте.АгентКопированияУстановлен = Истина)
				И (ИнформацияОКлиенте.АгентКопированияАктивирован_ЕстьФайлыСертификатов = Истина)
				И (АктивацииАгентовКопирования.АгентКопированияАктивирован_ДанныеВебСервисов = Истина) Тогда
			ЭтотОбъект.КаталогУстановкиАгентаКопирования = ИнформацияОКлиенте.КаталогУстановкиАгентаКопирования;
			// Текущая версия клиента не устарела? ////! Реализовать.
		Иначе
			ЕстьОшибки = Истина;
			КодРезультата = 1101;
			ОписаниеРезультата =
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("es='En este ordenador (el identificador: %1) es imposible trabajar con el Agente de la copia de reserva: "
""
""
""
"%2 %3 %4 %5';ru='На этом компьютере (идентификатор: %1) невозможно работать с Агентом резервного копирования:"
"%2"
"%3"
"%4"
"%5';en='On this computer (identifier:%1), it is impossible to work with the Backup Agent:"
"%2"
"%3"
"%4"
"%5'"),
					ИнформацияОКлиенте.ИдентификаторКомпьютера,
					?(ИнформацияОКлиенте.АгентКопированияУстановлен = Истина,
						" - " + НСтр("es='El agente de la copia de reserva es establecido';ru='Агент резервного копирования установлен';en='Backup agent installed'"),
						" - " + НСтр("es='El agente de la copia de reserva no es establecido';ru='Агент резервного копирования НЕ установлен';en='Backup agent is NOT installed'")),
					?(ИнформацияОКлиенте.АгентКопированияАктивирован_ЕстьФайлыСертификатов = Истина,
						" - " + НСтр("es='Los ficheros de los certificados son cargados';ru='Файлы сертификатов загружены';en='Certificate files uploaded'"),
						" - " + НСтр("es='El agente de la copia de reserva es establecido';ru='Агент резервного копирования установлен';en='Backup agent installed'")),
					?(АктивацииАгентовКопирования.АгентКопированияАктивирован_ДанныеВебСервисов = Истина,
						" - " + НСтр("es='El agente de la copia de reserva es activado al login corriente';ru='Агент резервного копирования активирован на текущий логин';en='Backup agent activated on current login'"),
						" - " + НСтр("es='Los ficheros de los certificados son cargados';ru='Файлы сертификатов загружены';en='Certificate files uploaded'")),
					?(АктивацииАгентовКопирования.АгентКопированияАктивированНаДругойЛогин = Истина,
						" - " + НСтр("es='El agente de la copia de reserva es activado a otro login';ru='Агент резервного копирования активирован на другой логин';en='Backup agent activated to another login'"),
						" - " + НСтр("es='El agente de la copia de reserva es activado al login corriente';ru='Агент резервного копирования активирован на текущий логин';en='Backup agent activated on current login'")));
		КонецЕсли;

	ИнтернетПоддержкаПользователейКлиентСервер.ЗавершитьРегистрациюРезультатаВыполненияОперации(
		КонтекстВыполнения,
		КодРезультата,
		ОписаниеРезультата,
		Неопределено);
#КонецОбласти

	// 2.2. В облачном хранилище достаточно места?
#Область ПроверкаВозможностиСозданияРезервнойКопии_НастройкиКлиентскогоКомпьютера
	//  Т.к. предсказать размер архива невозможно, то считаем, что должно быть свободно хотя бы 10 МБайт.
	ИнтернетПоддержкаПользователейКлиентСервер.НачатьРегистрациюРезультатаВыполненияОперации(
		КонтекстВыполнения,
		"ОблачныйАрхив.СозданиеФайлаРезервнойКопии.Инициализация.АнализДанных.ОстатокСвободногоМеста",
		НСтр("es='La comprobación del lugar libre en el depósito nuboso';ru='Проверка свободного места в облачном хранилище';en='Checking cloud storage free space'"));
	КодРезультата = 0;
	ОписаниеРезультата = "";

		БайтКуплено     = 0;
		БайтДоступно    = 0;
		ПроцентДоступно = "0%";

		Запись = РегистрыСведений.СвойстваХранилищаОблачногоАрхива.СоздатьМенеджерЗаписи();
		Запись.Свойство = "Объем байт, куплено"; // Идентификатор
		Запись.Прочитать(); // Только чтение, без последующей записи.
		Если Запись.Выбран() Тогда
			БайтКуплено = Запись.Значение;
		КонецЕсли;

		Запись = РегистрыСведений.СвойстваХранилищаОблачногоАрхива.СоздатьМенеджерЗаписи();
		Запись.Свойство = "Объем байт, доступно"; // Идентификатор
		Запись.Прочитать(); // Только чтение, без последующей записи.
		Если Запись.Выбран() Тогда
			БайтДоступно = Запись.Значение;
		КонецЕсли;

		Если БайтКуплено > 0 Тогда
			ПроцентДоступно = "" + Окр(БайтДоступно / БайтКуплено * 100, 0, РежимОкругления.Окр15как20) + "%";
		КонецЕсли;

		ОписаниеРезультата = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("es='El estado del depósito nuboso: "
"Es comprado: %1 bytes (%2 Mb, %3 Gbayt) "
"Son accesibles %4 bytes (%5 Mb, %6 Gbayt)';ru='Состояние облачного хранилища:"
"Куплено: %1 байт (%2 Мбайт, %3 Гбайт)"
"Доступно %4 байт (%5 Мбайт, %6 Гбайт)';en='Cloud storage status:"
"Purchased:%1 byte (%2 MB,%3 GB)"
"%4 bytes available (%5 MB,%6 GB)'"),
			Формат(БайтКуплено, "ЧЦ=20; ЧДЦ=; ЧРГ=' '; ЧН=0; ЧГ=3,0"),
			Формат(БайтКуплено, "ЧЦ=20; ЧДЦ=2; ЧС=6; ЧРД=,; ЧРГ=' '; ЧН=0,00; ЧГ=3,0"),
			Формат(БайтКуплено, "ЧЦ=20; ЧДЦ=2; ЧС=9; ЧРД=,; ЧРГ=' '; ЧН=0,00; ЧГ=3,0"),
			Формат(БайтДоступно, "ЧЦ=20; ЧДЦ=; ЧРГ=' '; ЧН=0; ЧГ=3,0"),
			Формат(БайтДоступно, "ЧЦ=20; ЧДЦ=2; ЧС=6; ЧРД=,; ЧРГ=' '; ЧН=0,00; ЧГ=3,0"),
			Формат(БайтДоступно, "ЧЦ=20; ЧДЦ=2; ЧС=9; ЧРД=,; ЧРГ=' '; ЧН=0,00; ЧГ=3,0"));
		Если БайтДоступно < 10*1024*1024 Тогда
			// Не считаем данное состояние ошибкой (это только предупреждение),
			//  т.к. только пользователь может определить - хватает ли ему места для копии или нет.
			КодРезультата = 1103;
			ОписаниеРезультата = ОписаниеРезультата + Символы.ПС + Символы.ПС
				+ НСтр("es='En el depósito nuboso no basta lugar para la creación de la copia de reserva (menos de 10 MB).';ru='В облачном хранилище недостаточно места для создания резервной копии (менее 10 МБайт).';en='There is not enough space in the cloud to back up (less than 10 MB).'");
		КонецЕсли;

		Элементы.ДекорацияСтатистика.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("es='Es accesible en total %1 de %2 Mb (%3)';ru='Всего доступно %1 из %2 Мбайт (%3)';en='Total% 1 of% 2 MB available (% 3)'"),
			Формат(БайтДоступно, "ЧЦ=20; ЧДЦ=; ЧС=6; ЧН=0; ЧГ=3,0"),
			Формат(БайтКуплено, "ЧЦ=20; ЧДЦ=; ЧС=6; ЧН=0; ЧГ=3,0"),
			ПроцентДоступно);

	ИнтернетПоддержкаПользователейКлиентСервер.ЗавершитьРегистрациюРезультатаВыполненияОперации(
		КонтекстВыполнения,
		КодРезультата,
		ОписаниеРезультата,
		Неопределено);
#КонецОбласти

#КонецОбласти

	// 3. Получение общих настроек (идентификатор ИБ).
#Область ПолучениеОбщихНастроек
	ИнтернетПоддержкаПользователейКлиентСервер.НачатьРегистрациюРезультатаВыполненияОперации(
		КонтекстВыполнения,
		"ОблачныйАрхив.СозданиеФайлаРезервнойКопии.Инициализация.ЧтениеНастроек.ОбщиеНастройки",
		НСтр("es='La lectura de los ajustes generales';ru='Чтение общих настроек';en='Read general settings'"));
	КодРезультата = 0;
	ОписаниеРезультата = "";

		ПараметрыОкруженияСервер = ОблачныйАрхив.ПолучитьНастройкиОблачногоАрхива("ПараметрыОкруженияСервер");
		ИдентификаторИБ = ПараметрыОкруженияСервер.ИдентификаторИБ;
		ИдентификаторИБ_Полный =
			ИдентификаторИБ
				+ ОблачныйАрхивКлиентСервер.ПолучитьОписаниеСуффиксовИдентификаторовИБ().РучнаяКопия.Суффикс;

	ИнтернетПоддержкаПользователейКлиентСервер.ЗавершитьРегистрациюРезультатаВыполненияОперации(
		КонтекстВыполнения,
		КодРезультата,
		ОписаниеРезультата,
		Неопределено);
#КонецОбласти

	// 4. Чтение настроек Агента резервного копирования.
#Область ЧтениеНастроекАгентаРезервногоКопирования
	ИнтернетПоддержкаПользователейКлиентСервер.НачатьРегистрациюРезультатаВыполненияОперации(
		КонтекстВыполнения,
		"ОблачныйАрхив.СозданиеФайлаРезервнойКопии.Инициализация.ЧтениеНастроек.НастройкиАгента",
		НСтр("es='La lectura de los ajustes del agente de la copia de reserva';ru='Чтение настроек агента резервного копирования';en='Reading backup agent settings'"));
	КодРезультата = 0;
	ОписаниеРезультата = "";

		НастройкиАгентаКопированияКлиент = ОблачныйАрхив.ПолучитьНастройкиОблачногоАрхива("НастройкиАгентаКопированияКлиент", ИмяКомпьютера());
		КаталогРабочий = НастройкиАгентаКопированияКлиент.КаталогРабочий;

		ЭтотОбъект.ИмяФайлаНастроекИБ = "";
		КаталогНастроекИБ = 
			НастройкиАгентаКопированияКлиент.КаталогРабочий
			+ ПолучитьРазделительПути()
			+ ИдентификаторИБ_Полный;
		МаскаФайлаНастроекИБ = "*_backupConfig.xml";
		МассивНайденныхФайлов = НайтиФайлы(КаталогНастроекИБ, МаскаФайлаНастроекИБ, Ложь);
		Если МассивНайденныхФайлов.Количество() >= 1 Тогда
			// Взять самый последний файл.
			ФайлНастроекИБ = МассивНайденныхФайлов.Получить(МассивНайденныхФайлов.Количество() - 1);
			Если ФайлНастроекИБ.Существует() Тогда
				ЭтотОбъект.ИмяФайлаНастроекИБ = ФайлНастроекИБ.ПолноеИмя;
			КонецЕсли;
		КонецЕсли;

		ОписаниеРезультата = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("es='La lectura de los ajustes del Agente de la copia de reserva: "
"el catálogo De trabajo: %1 "
"Identificador IB: %2 "
"Nombre del fichero de los ajustes: %3';ru='Чтение настроек Агента резервного копирования:"
"Рабочий каталог: %1"
"Идентификатор ИБ: %2"
"Имя файла настроек: %3';en='Reading backup agent settings:"
"Working Directory:%1"
"IB ID:%2"
"Settings file name:%3'"),
			КаталогРабочий,
			ИдентификаторИБ_Полный,
			ЭтотОбъект.ИмяФайлаНастроекИБ);

	ИнтернетПоддержкаПользователейКлиентСервер.ЗавершитьРегистрациюРезультатаВыполненияОперации(
		КонтекстВыполнения,
		КодРезультата,
		ОписаниеРезультата,
		Неопределено);
#КонецОбласти

	// 5. Чтение списка резервных копий.
#Область ЧтениеСпискаРезервныхКопий
	ИнтернетПоддержкаПользователейКлиентСервер.НачатьРегистрациюРезультатаВыполненияОперации(
		КонтекстВыполнения,
		"ОблачныйАрхив.СозданиеФайлаРезервнойКопии.Инициализация.ЧтениеНастроек.ЧтениеСпискаРезервныхКопий",
		НСтр("es='El análisis de la lista de las copias de reserva';ru='Анализ списка резервных копий';en='Backup list analysis'"));
	КодРезультата = 0;
	ОписаниеРезультата = "";

		ДатаПоследнегоРезервногоКопирования = '00010101';
		Запрос = Новый Запрос;
		Запрос.Текст = "
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|	Рег.ДатаСоздания КАК ДатаСоздания,
			|	Рег.РазмерФайла  КАК РазмерФайла
			|ИЗ
			|	РегистрСведений.РезервныеКопииОблачногоАрхива КАК Рег
			|ГДЕ
			|	Рег.ИдентификаторИБ ПОДОБНО ""&ИдентификаторИБ""
			|УПОРЯДОЧИТЬ ПО
			|	ДатаСоздания УБЫВ
			|";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИдентификаторИБ", ИдентификаторИБ + "%");

		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.Прямой);
			Если Выборка.Следующий() Тогда
				ДатаПоследнегоРезервногоКопирования = Выборка.ДатаСоздания;
			КонецЕсли;
		КонецЕсли;

		Если ДатаПоследнегоРезервногоКопирования = '00010101' Тогда
			ТекстЗаголовка = НСтр("es='La copia de reserva todavía era pasada nunca';ru='Резервное копирование еще ни разу не проводилось';en='No backups have been made yet.'");
		Иначе
			ТекстЗаголовка =
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("es='Por última vez la copia de reserva era pasada: %1';ru='В последний раз резервное копирование проводилось: %1';en='Last backup performed:% 1'"),
					Формат(ДатаПоследнегоРезервногоКопирования, "ДЛФ=ДДВ"));
		КонецЕсли;
		Элементы.ДекорацияДатаПроведенияПоследнегоРезервногоКопирования.Заголовок = ТекстЗаголовка;

		ОписаниеРезультата = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("es='El análisis de la lista de las copias de reserva: "
"el identificador IB: %1 "
"Fecha de la más última copia de reserva: %2';ru='Анализ списка резервных копий:"
"Идентификатор ИБ: %1"
"Дата самой последней резервной копии: %2';en='Analysis of the backup list:"
"IB ID:% 1"
"Date of most recent backup:% 2'"),
			ИдентификаторИБ + "*",
			ДатаПоследнегоРезервногоКопирования);

	ИнтернетПоддержкаПользователейКлиентСервер.ЗавершитьРегистрациюРезультатаВыполненияОперации(
		КонтекстВыполнения,
		КодРезультата,
		ОписаниеРезультата,
		Неопределено);
#КонецОбласти

	// 6. Настройки Авторизации.
#Область ПараметрыАвторизацииИПП

	// Не устанавливать привилегированный режим, чтобы читать / сохранять эти настройки мог только полноправный пользователь.
	ПараметрыАвторизацииИПП = ОблачныйАрхив.ПолучитьНастройкиОблачногоАрхива("ПараметрыАвторизацииИПП");
	ЭтотОбъект.Логин = ПараметрыАвторизацииИПП.Логин;

#КонецОбласти

	ЭтотОбъект.КаталогИБ = ОбщегоНазначенияКлиентСервер.КаталогФайловойИнформационнойБазы();
	ЭтотОбъект.КаталогИБ = ОблачныйАрхивКлиентСервер.ПривестиИмяКаталогаКПолномуВиду(ЭтотОбъект.КаталогИБ);

	ВремяОкончания = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("es='La creación de la copia de reserva, la inicialización de la forma, la terminación. "
"El tiempo del comienzo (мс): %1 "
"Tiempo de la terminación (мс): %2 "
"Duración (мс): %3 "
"Resultado de la ejecución: "
"%4';ru='Создание резервной копии, инициализация формы, завершение."
"Время начала (мс): %1"
"Время окончания (мс): %2"
"Длительность (мс): %3"
"Результат выполнения:"
"%4';en='Create a backup, initialize the form, complete."
"Start time (ms):%1"
"End time (ms):%2"
"Duration (ms):%3"
"Execution result:"
"%4'")
			+ Символы.ПС,
		ВремяНачала,
		ВремяОкончания,
		ВремяОкончания - ВремяНачала,
		ИнтернетПоддержкаПользователейКлиентСервер.ПредставлениеЗаписиРезультатовВыполненияОпераций(
			КонтекстВыполнения,
			Истина, // ВключаяВложенные
			"ПодробноПоШагам",
			1));

	// Запись в журнал регистрации.
	ИнтернетПоддержкаПользователей.ЗаписатьСообщениеВЖурналРегистрации(
		НСтр("es='БИП:ОблачныйАрхив. El servicio y el reglamento';ru='БИП:ОблачныйАрхив.Сервис и регламент';en='БИП:ОблачныйАрхив.Сервис и регламент'"), // Имя события
		НСтр("es='El archivo nuboso. El servicio y el reglamento. La copia de reserva. La inicialización';ru='Облачный архив. Сервис и регламент. Резервное копирование. Инициализация';en='Cloud Archive. Service and regulations. Backup. Initialization'"), // ИмяСобытия
		УровеньЖурналаРегистрации.Информация, // УровеньЖурналаРегистрации.*
		, // ОбъектМетаданных
		(ВремяОкончания - ВремяНачала), // Данные
		ТекстСообщения, // Комментарий
		ОблачныйАрхивПовтИсп.ВестиПодробныйЖурналРегистрации()); // ВестиПодробныйЖурналРегистрации

	Если ЕстьОшибки = Истина Тогда
		// Если есть ошибки, то сразу открыть страницу с ошибками.
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаОшибка;
	Иначе
		// Если нет ошибок, то вывести страницу с предупреждением о длительной операции.
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаПредупреждениеОДлительнойОперации;
	КонецЕсли;

	ОбновитьИнформационныеСтроки();

	УправлениеФормой(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Если ПустаяСтрока(ЭтотОбъект.Логин) Тогда
		Отказ = Истина;
		// Чтобы появилось окно ввода логина / пароля ВебИТС.
		ОблачныйАрхивКлиент.ПодключитьСервисОблачныйАрхив();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)

	ПрочиеПараметры = Новый Структура;
	ОблачныйАрхивКлиент.ОбработкаНавигационнойСсылки(
		ЭтотОбъект,
		Элемент,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка,
		ПрочиеПараметры);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаДалее(Команда)

	// Проверить возможность перехода.

	лкТекущаяСтраница = Элементы.ГруппаСтраницы.ТекущаяСтраница;
	Если лкТекущаяСтраница = Элементы.СтраницаПредупреждениеОДлительнойОперации Тогда
		// Переход возможен только если активен один сеанс.
		ОбновитьИнформационныеСтроки();
		Если ЭтотОбъект.КоличествоАктивныхСеансов <= 1 Тогда // Проверка количества сеансов.
			// Начать резервное копирование.
			НачатьРезервноеКопирование();
		Иначе
			// Перейти на страницу со списком активных сеансов.
			Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаПодготовкаКСозданиюРезервнойКопии;
			УправлениеФормой(ЭтотОбъект);
		КонецЕсли;
	ИначеЕсли лкТекущаяСтраница = Элементы.СтраницаПодготовкаКСозданиюРезервнойКопии Тогда
		ОбновитьИнформационныеСтроки();
		Если ЭтотОбъект.КоличествоАктивныхСеансов <= 1 Тогда // Проверка количества сеансов.
			// Начать резервное копирование.
			НачатьРезервноеКопирование();
		Иначе
			// Перейти на страницу со списком активных сеансов.
			Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаПодготовкаКСозданиюРезервнойКопии;
			УправлениеФормой(ЭтотОбъект);
		КонецЕсли;
	ИначеЕсли лкТекущаяСтраница = Элементы.СтраницаОшибка Тогда
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КомандаНазад(Команда)

	лкТекущаяСтраница = Элементы.ГруппаСтраницы.ТекущаяСтраница;
	Если лкТекущаяСтраница = Элементы.СтраницаПредупреждениеОДлительнойОперации Тогда
	ИначеЕсли лкТекущаяСтраница = Элементы.СтраницаПодготовкаКСозданиюРезервнойКопии Тогда
	ИначеЕсли лкТекущаяСтраница = Элементы.СтраницаОшибка Тогда
		// Переход назад со страницы ошибок.
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция возвращает количество сторонних сеансов соединения с ИБ.
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//   Число - Количество активных сеансов, кроме этого, консоли кластеров и других (которые не мешают восстановлению из резервной копии).
//
&НаСервереБезКонтекста
Функция КоличествоСеансовИнформационнойБазы()

	Возврат СоединенияИБ.КоличествоСеансовИнформационнойБазы(Ложь, Ложь);

КонецФункции

// Обновляет информационные надписи.
//
// Параметры:
//  Нет.
//
&НаСервере
Процедура ОбновитьИнформационныеСтроки()

	лкТекущаяСтраница = Элементы.ГруппаСтраницы.ТекущаяСтраница;
	Если (лкТекущаяСтраница = Элементы.СтраницаПредупреждениеОДлительнойОперации)
			ИЛИ (лкТекущаяСтраница = Элементы.СтраницаПодготовкаКСозданиюРезервнойКопии) Тогда
		ЭтотОбъект.КоличествоАктивныхСеансов = КоличествоСеансовИнформационнойБазы();
		Элементы.ДекорацияПодготовкаКСозданиюРезервнойКопииТекст.Заголовок = Новый ФорматированнаяСтрока(
			НСтр("es='Es hecha la desconexión de las sesiones de otros usuarios "
"que trabajan en el programa.';ru='Производится отключение сеансов других пользователей,"
"работающих в программе.';en='Disabling sessions of other users,"
"working in the program.'"),
			Символы.ПС,
			Символы.ПС,
			Новый ФорматированнаяСтрока(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("es='Las sesiones activas: %1';ru='Активные сеансы: %1';en='Active sessions:% 1'"),
					ЭтотОбъект.КоличествоАктивныхСеансов), // Содержимое
				, // Шрифт
				, // ЦветТекста
				, // ЦветФона
				"backup1C:OpenActiveSessionsList"), // Ссылка
			Символы.ПС,
			Символы.ПС,
			НСтр("es='Hay unas sesiones activas del trabajo con el programa, "
"que no pueden ser acabados forzadamente.';ru='Имеются активные сеансы работы с программой,"
"которые не могут быть завершены принудительно.';en='There are active sessions with the program,"
"which cannot be forcibly completed.'"));

	ИначеЕсли лкТекущаяСтраница = Элементы.СтраницаОшибка Тогда
	КонецЕсли;

КонецПроцедуры

// Управляет видимостью и доступностью элементов управления.
//
// Параметры:
//  Форма  - Управляемая форма - форма, в которой необходимо установить видимость / доступность.
//
&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)

	Элементы = Форма.Элементы;
	ТекущаяСтраница = Элементы.ГруппаСтраницы.ТекущаяСтраница;

	лкНазад      = Элементы.КомандаНазад;
	лкДалее      = Элементы.КомандаДалее;
	лкЗакрыть    = Элементы.КомандаЗакрыть;

	Если ТекущаяСтраница = Элементы.СтраницаПредупреждениеОДлительнойОперации Тогда
#Область СтраницаПредупреждениеОДлительнойОперации

		лкНазад.Видимость   = Ложь;
		лкДалее.Видимость   = Истина;
		лкЗакрыть.Видимость = Истина;

		лкДалее.Заголовок = НСтр("es='Crear la copia de reserva';ru='Создать резервную копию';en='Create back up'");
		лкДалее.КнопкаПоУмолчанию = Истина;

		лкЗакрыть.Заголовок = НСтр("en='cancel';es='La anulación';ru='Отмена'");

#КонецОбласти

	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаПодготовкаКСозданиюРезервнойКопии Тогда
#Область СтраницаПодготовкаКСозданиюРезервнойКопии

		лкНазад.Видимость   = Ложь;
		лкДалее.Видимость   = Истина;
		лкЗакрыть.Видимость = Истина;

		// Если активных сеансов нет, то нажатие на кнопку Далее = "Сохранить", иначе "Повторить проверку количества сеансов".
		Если Форма.КоличествоАктивныхСеансов <= 1 Тогда // Проверка количества сеансов.
			лкДалее.Заголовок = НСтр("es='Crear la copia de reserva';ru='Создать резервную копию';en='Create back up'");
		Иначе
			лкДалее.Заголовок = НСтр("es='Renovar';ru='Обновить';en='Update'");
		КонецЕсли;
		лкДалее.КнопкаПоУмолчанию = Истина;

		лкЗакрыть.Заголовок = НСтр("en='cancel';es='La anulación';ru='Отмена'");

#КонецОбласти

	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаОшибка Тогда
#Область СтраницаОшибка

		лкНазад.Видимость   = Ложь;
		лкДалее.Видимость   = Ложь;
		лкЗакрыть.Видимость = Истина;
		лкЗакрыть.КнопкаПоУмолчанию = Истина;
		лкЗакрыть.Заголовок = НСтр("es='Cerrar';ru='Закрыть';en='Close'");

#КонецОбласти

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НачатьРезервноеКопирование()

	ВремяНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
	КонтекстВыполнения = ИнтернетПоддержкаПользователейКлиентСервер.НоваяЗаписьРезультатовВыполненияОпераций();

	// Процесс резервного копирования в 1С:Облачный архив состоит из следующих шагов:
	// 1. Установить блокировку сеансов на 2 минуты.

	КодРезультата = 0;
	ОписаниеРезультата = "";
	ИнтернетПоддержкаПользователейКлиентСервер.НачатьРегистрациюРезультатаВыполненияОперации(
		КонтекстВыполнения,
		"ОблачныйАрхив.СозданиеФайлаРезервнойКопии.ЗапускРезервирования.УстановкаБлокировкиСеансов",
		НСтр("es='El lanzamiento de la copia de reserva, la instalación del bloqueo';ru='Запуск резервного копирования, установка блокировки';en='Lauching backup, set lock'"));

		УстановитьБлокировкуСеансовНа2Минуты();

	ИнтернетПоддержкаПользователейКлиентСервер.ЗавершитьРегистрациюРезультатаВыполненияОперации(
		КонтекстВыполнения,
		КодРезультата,
		ОписаниеРезультата,
		Неопределено);

	// 2. Выполнить все операции с настройками.
	КонтекстВыполненияВложенный = ИнтернетПоддержкаПользователейКлиентСервер.НоваяЗаписьРезультатовВыполненияОпераций();

	ИнтернетПоддержкаПользователейКлиентСервер.НачатьРегистрациюРезультатаВыполненияОперации(
		КонтекстВыполнения,
		"ОблачныйАрхив.СозданиеФайлаРезервнойКопии.ЗапускРезервирования.ИзменениеНастроек",
		НСтр("es='El lanzamiento de la copia de reserva, el cambio de los ajustes para el Agente de la copia de reserva';ru='Запуск резервного копирования, изменение настроек для Агента резервного копирования';en='Launching backup, changing settings for Backup Agent'"));
	КодРезультата = 0;
	ОписаниеРезультата = "";

		ИзменитьНастройкиАгентаРезервногоКопирования(
			КонтекстВыполненияВложенный,
			ЭтотОбъект.ИмяФайлаНастроекИБ,
			ЭтотОбъект.КаталогУстановкиАгентаКопирования);

	ИнтернетПоддержкаПользователейКлиентСервер.ЗавершитьРегистрациюРезультатаВыполненияОперации(
		КонтекстВыполнения,
		КодРезультата,
		ОписаниеРезультата,
		КонтекстВыполненияВложенный);

	// 3. Подготовка к выходу из программы.
	ИнтернетПоддержкаПользователейКлиентСервер.НачатьРегистрациюРезультатаВыполненияОперации(
		КонтекстВыполнения,
		"ОблачныйАрхив.СозданиеФайлаРезервнойКопии.ЗапускРезервирования.ПодготовкаКВыходу",
		НСтр("es='El lanzamiento de la copia de reserva, la preparación para la salida del programa';ru='Запуск резервного копирования, подготовка к выходу из программы';en='Launching backup, preparing to exit the program'"));
	КодРезультата = 0;
	ОписаниеРезультата = "";

		СоединенияИБКлиент.УстановитьПризнакЗавершитьВсеСеансыКромеТекущего(Истина);
		СоединенияИБКлиент.УстановитьПризнакРаботаПользователейЗавершается(Истина);

	ИнтернетПоддержкаПользователейКлиентСервер.ЗавершитьРегистрациюРезультатаВыполненияОперации(
		КонтекстВыполнения,
		КодРезультата,
		ОписаниеРезультата,
		Неопределено);

	// 4. Лог.
	ВремяОкончания = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("es='El lanzamiento de la copia de reserva. "
"El tiempo del comienzo (мс): %1 "
"Tiempo de la terminación (мс): %2 "
"Duración (мс): %3 "
"Resultado de la ejecución: "
"%4';ru='Запуск резервного копирования."
"Время начала (мс): %1"
"Время окончания (мс): %2"
"Длительность (мс): %3"
"Результат выполнения:"
"%4';en='Launching backup."
"Start time (ms):%1"
"End time (ms):%2"
"Duration (ms):%3"
"Execution result:"
"%4'")
			+ Символы.ПС,
		ВремяНачала,
		ВремяОкончания,
		ВремяОкончания - ВремяНачала,
		ИнтернетПоддержкаПользователейКлиентСервер.ПредставлениеЗаписиРезультатовВыполненияОпераций(
			КонтекстВыполнения,
			Истина, // ВключаяВложенные
			"ПодробноПоШагам",
			1));
	// Запись в журнал регистрации.
	ИнтернетПоддержкаПользователейВызовСервера.ЗаписатьСообщениеВЖурналРегистрации(
		НСтр("es='БИП:ОблачныйАрхив. El servicio y el reglamento';ru='БИП:ОблачныйАрхив.Сервис и регламент';en='БИП:ОблачныйАрхив.Сервис и регламент'"), // Имя события
		НСтр("es='El archivo nuboso. El servicio y el reglamento. La copia de reserva. La terminación';ru='Облачный архив. Сервис и регламент. Резервное копирование. Завершение';en='Cloud Archive. Service and regulations. Backup. Completing'"), // ИмяСобытия
		"Информация", // УровеньЖурналаРегистрации.*
		, // ОбъектМетаданных
		(ВремяОкончания - ВремяНачала), // Данные
		ТекстСообщения, // Комментарий
		ОблачныйАрхивКлиентПовтИсп.ВестиПодробныйЖурналРегистрации()); // ВестиПодробныйЖурналРегистрации

	// 5. Выйти из программы.
	СоединенияИБКлиент.ЗавершитьРаботуЭтогоСеанса(Ложь); // ВыводитьВопрос = Ложь.
	ЗавершитьРаботуСистемы(Ложь);

КонецПроцедуры

// Устанавливает блокировку сеанса на 2 минуты.
//
// Параметры:
//  Нет.
//
&НаСервереБезКонтекста
Процедура УстановитьБлокировкуСеансовНа2Минуты()

	КодРазрешения = "РезервноеКопирование"; // Идентификатор.
	Блокировка = Новый БлокировкаСеансов;
	Блокировка.Установлена = Истина;
	Блокировка.Начало = ТекущаяДатаСеанса();
	Блокировка.Конец  = ТекущаяДатаСеанса() + 2*60;
	Блокировка.КодРазрешения = КодРазрешения;
	Блокировка.Сообщение = СоединенияИБ.СформироватьСообщениеБлокировки(
		НСтр("es='Se cumple la copia de reserva. La entrada en la base informativa es bloqueada para 2 minutos.';ru='Выполняется резервное копирование. Вход в информационную базу заблокирован на 2 минуты.';en='The backup is in progress. Entrance to the infobase is blocked for 2 minutes.'"),
		КодРазрешения);
	УстановитьБлокировкуСеансов(Блокировка);

КонецПроцедуры

// Изменяет настройки агента резервного копирования.
//
// Параметры:
//  КонтекстВыполнения                - Структура - контекст выполнения;
//  ИмяФайлаНастроекИБ                - Строка - имя файла настроек;
//  КаталогУстановкиАгентаКопирования - Строка - каталог установки Агента резервного копирования.
//
&НаСервере
Процедура ИзменитьНастройкиАгентаРезервногоКопирования(КонтекстВыполнения, ИмяФайлаНастроекИБ, КаталогУстановкиАгентаКопирования)

	ТипСтруктура = Тип("Структура");
	СтруктураНастроекИБ = Неопределено;

	// 1. В файле настроек Агента резервного копирования необходимо добавить строку с указанием,
	//    что необходимо немедленно провести резервное копирование.
#Область ЧтениеНастроек
	// Найти и перезаписать файл с настройками текущей ИБ.
	КодРезультата = 0;
	ОписаниеРезультата = "";
	ИнтернетПоддержкаПользователейКлиентСервер.НачатьРегистрациюРезультатаВыполненияОперации(
		КонтекстВыполнения,
		"ОблачныйАрхив.СозданиеФайлаРезервнойКопии.ЗапускРезервирования.ИзменениеНастроек.ЧтениеНастроек",
		НСтр("es='El lanzamiento de la copia de reserva, el cambio de los ajustes para el Agente de la copia de reserva, la lectura de los ajustes';ru='Запуск резервного копирования, изменение настроек для Агента резервного копирования, чтение настроек';en='Launching backup, change settings for Backup Agent, read settings'"));

		// Для ручной копии всегда брать новые настройки.
		// Создать настройки по-умолчанию.
		СтруктураНастроекИБ = ОблачныйАрхив.ПреобразоватьФайлXMLВСтруктуру("Макет.НастройкиИБ");
		ПараметрыОкруженияСервер = ОблачныйАрхив.ПолучитьНастройкиОблачногоАрхива("ПараметрыОкруженияСервер");
			ИмяИБ = ПараметрыОкруженияСервер.ИмяИБ;
			ИмяИБ_Полный =
				ИмяИБ
					+ ОблачныйАрхивКлиентСервер.ПолучитьОписаниеСуффиксовИдентификаторовИБ().РучнаяКопия.Описание;
			ИдентификаторИБ = ПараметрыОкруженияСервер.ИдентификаторИБ;
			ИдентификаторИБ_Полный =
				ИдентификаторИБ
					+ ОблачныйАрхивКлиентСервер.ПолучитьОписаниеСуффиксовИдентификаторовИБ().РучнаяКопия.Суффикс;
		НастройкиАгентаКопированияОбщие = ОблачныйАрхив.ПолучитьНастройкиОблачногоАрхива("НастройкиАгентаКопированияОбщие");
			КоличествоХранимыхКопий_Ежемесячные  = НастройкиАгентаКопированияОбщие.КоличествоХранимыхКопий_Ежемесячные;
			КоличествоХранимыхКопий_Еженедельные = НастройкиАгентаКопированияОбщие.КоличествоХранимыхКопий_Еженедельные;
			КоличествоХранимыхКопий_Ежедневные   = НастройкиАгентаКопированияОбщие.КоличествоХранимыхКопий_Ежедневные;

		// В настройках установить правильные параметры секции DatabaseBackupConfiguration/Database:
		// - DB_ID,
		// - DBName,
		// - DBFolder.
		// Удалить все расписания кроме BackupNow.
		// В настройках установить правильные параметры секции DatabaseBackupConfiguration/RetentionRule:
		// - Daily,
		// - Weekly,
		// - Monthly.

		// Текст, Атрибуты, Элементы.
		Если ТипЗнч(СтруктураНастроекИБ) = ТипСтруктура Тогда
			ВложенныеЭлементы = СтруктураНастроекИБ.Элементы;
			Если ВложенныеЭлементы.Свойство("DatabaseBackupConfiguration") Тогда
				ВложенныеЭлементы = ВложенныеЭлементы.DatabaseBackupConfiguration.Элементы;
				Если ВложенныеЭлементы.Свойство("Database") Тогда
					СтруктураИБ = ВложенныеЭлементы.Database;
					СтруктураИБ.Элементы.Вставить("DB_ID", Новый Структура("Текст", ИдентификаторИБ_Полный));
					СтруктураИБ.Элементы.Вставить("DBName", Новый Структура("Текст", ИмяИБ_Полный));
					СтруктураИБ.Элементы.Вставить("DBFolder", Новый Структура("Текст", ЭтотОбъект.КаталогИБ));
				КонецЕсли;
				Если ВложенныеЭлементы.Свойство("RetentionRule") Тогда
					СтруктураДлительностиХраненияКопий = ВложенныеЭлементы.RetentionRule;
					СтруктураДлительностиХраненияКопий.Элементы.Вставить("Daily", Новый Структура("Текст", КоличествоХранимыхКопий_Ежедневные));
					СтруктураДлительностиХраненияКопий.Элементы.Вставить("Weekly", Новый Структура("Текст", КоличествоХранимыхКопий_Еженедельные));
					СтруктураДлительностиХраненияКопий.Элементы.Вставить("Monthly", Новый Структура("Текст", КоличествоХранимыхКопий_Ежемесячные));
				КонецЕсли;
				Если ВложенныеЭлементы.Свойство("Schedule") Тогда
					СтруктураРасписания = ВложенныеЭлементы.Schedule;
					СтруктураРасписания.Элементы = Новый Структура; // Очистка расписания.
					// При этом удалятся все остальные элементы:
					// - BackupNow;
					// - Time;
					// - BackupDaily;
					// - BackupWeekly;
					// - BackupMonthly.
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;

		ОписаниеРезультата = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("es='Son creados los ajustes por-reticencia: "
"%1';ru='Созданы настройки по-умолчанию:"
"%1';en='Created default settings:"
"%1'"),
			ИнтернетПоддержкаПользователейКлиентСервер.ПредставлениеЗначения(СтруктураНастроекИБ, "=", Символы.ПС));

	ИнтернетПоддержкаПользователейКлиентСервер.ЗавершитьРегистрациюРезультатаВыполненияОперации(
		КонтекстВыполнения,
		КодРезультата,
		ОписаниеРезультата,
		Неопределено);
#КонецОбласти

	// 2. Изменить настройки.
#Область ИзменениеНастроек
	// Пройтись по настройкам, найти / добавить настройку DatabaseBackupConfiguration/Schedule/BackupNow с атрибутом delay="30".
	КодРезультата = 0;
	ОписаниеРезультата = "";
	ИнтернетПоддержкаПользователейКлиентСервер.НачатьРегистрациюРезультатаВыполненияОперации(
		КонтекстВыполнения,
		"ОблачныйАрхив.СозданиеФайлаРезервнойКопии.ЗапускРезервирования.ИзменениеНастроек.ДобавлениеНастроекНемедленногоКопирования",
		НСтр("es='El lanzamiento de la copia de reserva, el cambio de los ajustes para el Agente de la copia de reserva, la adición de los ajustes para la copia inmediata';ru='Запуск резервного копирования, изменение настроек для Агента резервного копирования, добавление настроек для немедленного копирования';en='Launching backup, changing settings for Backup Agent, adding settings for immediate backup'"));

		// Текст, Атрибуты, Элементы.
		Если ТипЗнч(СтруктураНастроекИБ) = ТипСтруктура Тогда
			ВложенныеЭлементы = СтруктураНастроекИБ.Элементы;
			Если ВложенныеЭлементы.Свойство("DatabaseBackupConfiguration") Тогда
				ВложенныеЭлементы = ВложенныеЭлементы.DatabaseBackupConfiguration.Элементы;
				Если ВложенныеЭлементы.Свойство("Schedule") Тогда
					СтруктураРасписания = ВложенныеЭлементы.Schedule;
					Если ТипЗнч(СтруктураРасписания.Элементы) <> ТипСтруктура Тогда
						СтруктураРасписания.Элементы = Новый Структура;
					КонецЕсли;
					СтруктураЗадержки  = Новый Структура("delay", 30);
					СтруктураАтрибутов = Новый Структура("Атрибуты", СтруктураЗадержки);
					СтруктураРасписания.Элементы.Вставить("BackupNow", СтруктураАтрибутов);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;

		ОписаниеРезультата = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("es='Son cambiados los ajustes: "
"%1';ru='Изменены настройки:"
"%1';en='Changed settings:"
"%1'"),
			ИнтернетПоддержкаПользователейКлиентСервер.ПредставлениеЗначения(СтруктураНастроекИБ, "=", Символы.ПС));

	ИнтернетПоддержкаПользователейКлиентСервер.ЗавершитьРегистрациюРезультатаВыполненияОперации(
		КонтекстВыполнения,
		КодРезультата,
		ОписаниеРезультата,
		Неопределено);
#КонецОбласти

	// 3. Сохранить настройки.
#Область ЗаписьНастроек
	КодРезультата = 0;
	ОписаниеРезультата = "";
	ИнтернетПоддержкаПользователейКлиентСервер.НачатьРегистрациюРезультатаВыполненияОперации(
		КонтекстВыполнения,
		"ОблачныйАрхив.СозданиеФайлаРезервнойКопии.ЗапускРезервирования.ИзменениеНастроек.ЗаписьФайлаНастроек",
		НСтр("es='El lanzamiento de la copia de reserva, el cambio de los ajustes para el Agente de la copia de reserva, el registro del fichero de los ajustes';ru='Запуск резервного копирования, изменение настроек для Агента резервного копирования, запись файла настроек';en='Launching backup, changing settings for the Backup Agent, writing the settings file'"));

		ИмяВременногоФайлаНастроекИБ = ПолучитьИмяВременногоФайла("xml");
		ОблачныйАрхив.ПреобразоватьСтруктуруВФайлXML(ИмяВременногоФайлаНастроекИБ, СтруктураНастроекИБ);

	ИнтернетПоддержкаПользователейКлиентСервер.ЗавершитьРегистрациюРезультатаВыполненияОперации(
		КонтекстВыполнения,
		КодРезультата,
		ОписаниеРезультата,
		Неопределено);
#КонецОбласти

	// 4. Запустить Агент резервного копирования, чтобы он перечитал настройки.
#Область РеинициализацияАгентаРезервногоКопирования
	КодРезультата = 0;
	ОписаниеРезультата = "";
	ИнтернетПоддержкаПользователейКлиентСервер.НачатьРегистрациюРезультатаВыполненияОперации(
		КонтекстВыполнения,
		"ОблачныйАрхив.СозданиеФайлаРезервнойКопии.ЗапускРезервирования.ИзменениеНастроек.РеинициализацияАгентаРезервногоКопирования",
		НСтр("es='El lanzamiento de la copia de reserva, el cambio de los ajustes para el Agente de la copia de reserva, реинициализация del agente de la copia de reserva';ru='Запуск резервного копирования, изменение настроек для Агента резервного копирования, реинициализация агента резервного копирования';en='Launching backup, changing settings for the Backup Agent, reinitializing the backup agent'"));

		СтрокаКоманды =
			""""
			+ КаталогУстановкиАгентаКопирования
			+ ПолучитьРазделительПути()
			+ "BackupAgent.exe"
			+ """"
			+ " update_task_config -path="
				+ """"
				+ ИмяВременногоФайлаНастроекИБ
				+ """";

		ПараметрыЗапускаПрограммы = ФайловаяСистема.ПараметрыЗапускаПрограммы();
		ПараметрыЗапускаПрограммы.ДождатьсяЗавершения = Истина;
		ПараметрыЗапускаПрограммы.ТекущийКаталог      = ЭтотОбъект.КаталогУстановкиАгентаКопирования;
		РезультатЗапускаПрограммы = ФайловаяСистема.ЗапуститьПрограмму(СтрокаКоманды, ПараметрыЗапускаПрограммы);
		КодВозврата = РезультатЗапускаПрограммы.КодВозврата;

	ОписаниеРезультата = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("es='La orden реинициализации: %1 "
"Código del regreso: %2';ru='Команда реинициализации: %1"
"Код возврата: %2';en='Reinitialization command:%1"
"Return code:%2'"),
		СтрокаКоманды,
		КодВозврата);

	ИнтернетПоддержкаПользователейКлиентСервер.ЗавершитьРегистрациюРезультатаВыполненияОперации(
		КонтекстВыполнения,
		КодРезультата,
		ОписаниеРезультата,
		Неопределено);
#КонецОбласти

	// 5. Удаление временного файла.
#Область УдалениеВременногоФайла
	КодРезультата = 0;
	ОписаниеРезультата = "";
	ИнтернетПоддержкаПользователейКлиентСервер.НачатьРегистрациюРезультатаВыполненияОперации(
		КонтекстВыполнения,
		"ОблачныйАрхив.СозданиеФайлаРезервнойКопии.ЗапускРезервирования.ИзменениеНастроек.УдалениеВременныхФайлов",
		НСтр("es='El lanzamiento de la copia de reserva, el cambio de los ajustes para el Agente de la copia de reserva, la desaparición de los ficheros temporales';ru='Запуск резервного копирования, изменение настроек для Агента резервного копирования, удаление временных файлов';en='Launching backup, changing settings for Backup Agent, deleting temporary files'"));

		Попытка
			УдалитьФайлы(ИмяВременногоФайлаНастроекИБ);
			ТекстРезультата = НСтр("es='Es con éxito quitado';ru='Успешно удален';en='Successfully deleted'");
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ТекстРезультата = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("es='La falta de la desaparición: "
"%1';ru='Ошибка удаления:"
"%1';en='Error deleting:"
"%1'"),
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		КонецПопытки;

	ОписаниеРезультата = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("es='La desaparición del fichero temporal: %1 "
"Resultado: %2';ru='Удаление временного файла: %1"
"Результат: %2';en='Deleting temporary file:%1"
"Result:%2 '"),
		ИмяВременногоФайлаНастроекИБ,
		ТекстРезультата);

	ИнтернетПоддержкаПользователейКлиентСервер.ЗавершитьРегистрациюРезультатаВыполненияОперации(
		КонтекстВыполнения,
		КодРезультата,
		ОписаниеРезультата,
		Неопределено);
#КонецОбласти

КонецПроцедуры

// Загружает из веб-сервисов статистику и список резервных копий и собирает информацию о клиентском компьютере.
//
// Параметры:
//  СрокЖизниСтатистики - Число - количество секунд, сколько собранная статистика считается актуальной,
//                        если 0 - обновить принудительно.
//
&НаСервере
Процедура ЗагрузитьСтатистику(СрокЖизниСтатистики = 300)

	// Сбор информации запускается сразу, а не фоновым заданием.
	МассивШагов = Новый Массив;

		ШагСбораДанных = ОблачныйАрхивКлиентСервер.ПолучитьОписаниеШагаСбораДанных();
			ШагСбораДанных.КодШага               = "ИнформацияОКлиенте"; // Идентификатор
			ШагСбораДанных.ОписаниеШага          = НСтр("es='La recogida de la información sobre el ordenador de clientes';ru='Сбор информации о клиентском компьютере';en='Collecting client computer information'");
			ШагСбораДанных.СрокУстареванияСекунд = СрокЖизниСтатистики; // Обновлять только если данные были собраны > 5 минут назад.
		МассивШагов.Добавить(ШагСбораДанных);

		ШагСбораДанных = ОблачныйАрхивКлиентСервер.ПолучитьОписаниеШагаСбораДанных();
			ШагСбораДанных.КодШага               = "СвойстваХранилищаОблачногоАрхива"; // Идентификатор
			ШагСбораДанных.ОписаниеШага          = НСтр("es='La recogida de la información sobre el uso del depósito nuboso';ru='Сбор информации об использовании облачного хранилища';en='Cloud storage usage information'");
			ШагСбораДанных.СрокУстареванияСекунд = СрокЖизниСтатистики; // Обновлять только если данные были собраны > 5 минут назад.
		МассивШагов.Добавить(ШагСбораДанных);

		ШагСбораДанных = ОблачныйАрхивКлиентСервер.ПолучитьОписаниеШагаСбораДанных();
			ШагСбораДанных.КодШага               = "НастройкиАгентаКопированияКлиент"; // Идентификатор
			ШагСбораДанных.ОписаниеШага          = НСтр("es='La lectura de los ajustes del Agente de la copia de reserva';ru='Чтение настроек Агента резервного копирования';en='Reading backup agent settings'");
			ШагСбораДанных.СрокУстареванияСекунд = СрокЖизниСтатистики; // Обновлять только если данные были собраны > 5 минут назад.
		МассивШагов.Добавить(ШагСбораДанных);

		ШагСбораДанных = ОблачныйАрхивКлиентСервер.ПолучитьОписаниеШагаСбораДанных();
			ШагСбораДанных.КодШага               = "АктивацииАгентовКопирования"; // Идентификатор
			ШагСбораДанных.ОписаниеШага          = НСтр("es='La comprobación de la activación del Agente de la copia de reserva en este ordenador';ru='Проверка активации Агента резервного копирования на этом компьютере';en='Verifying the activation of the Backup agent on this computer'");
			ШагСбораДанных.СрокУстареванияСекунд = СрокЖизниСтатистики; // Обновлять только если данные были собраны > 5 минут назад.
		МассивШагов.Добавить(ШагСбораДанных);

		ШагСбораДанных = ОблачныйАрхивКлиентСервер.ПолучитьОписаниеШагаСбораДанных();
			ШагСбораДанных.КодШага               = "СписокРезервныхКопий"; // Идентификатор
			ШагСбораДанных.ОписаниеШага          = НСтр("es='La recepción de la lista de las copias de reserva';ru='Получение списка резервных копий';en='Retrieving a list of backups'");
			ШагСбораДанных.СрокУстареванияСекунд = СрокЖизниСтатистики; // Обновлять только если данные были собраны > 5 минут назад.
		МассивШагов.Добавить(ШагСбораДанных);

	ОблачныйАрхив.СобратьДанныеПоОблачномуАрхиву(Новый Структура("МассивШагов", МассивШагов), "");

КонецПроцедуры

#КонецОбласти
